# Conductor Size Get Conductor Size Method

Source: https://www.revitapidocs.com/2026/cee6bfc3-50f9-c0b7-d4e1-9fd01d36c8d3.htm

---

| Conductor Size Get Conductor Size Method |
| --- |

Gets the Conductor Size data by given Conductor Size id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ConductorSize GetConductorSize(
	Document document,
	ElementId conductorSizeId
)
```

```
Public Shared Function GetConductorSize (
	document As Document,
	conductorSizeId As ElementId
) As ConductorSize
```

```
public:
static ConductorSize^ GetConductorSize(
	Document^ document,
	ElementId^ conductorSizeId
)
```

```
static member GetConductorSize :
        document : Document *
        conductorSizeId : ElementId -> ConductorSize
```

#### Parameters

document Document
:   The document.

conductorSizeId ElementId
:   The Conductor Size id.

#### Return Value

ConductorSize
The Conductor Size data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  The id is not a Conductor Size id. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace